<?php
/**
 * @File: msg.php
 * @Author: xiongjinhai
 * @Email:562740366@qq.com
 * @Date: 2018/3/9下午5:11
 * @Version:Version:1.1 2017 by www.dsweixin.com All Rights Reserver
 */

return [
    ""          => "未知错误,请联系客服人员",
    "0"    	    => "成功",
    "-1000"     => "请输入正确的11位手机号码",
    "-1001"     => "请输入正确的11位手机号码",
    "-1002"     => "您已经获取验证码,请稍后再试",
    "-1003"     => "请过一分钟再发送",
    "-1004"     => "超出当日短信发送次数限制，获取失败",
    "-1005"     => "短信验证配置失败,请联系客服人员",
    "-1006"     => "请填写验证码",
    "-1007"     => "请获取验证码后再登录",
    "-1008"     => "验证码错误次数过多，请重新获取",
    "-1009"     => "验证码错误,请重新输入",
    "-1010"     => "验证码已过期,请重新获取",
    "-1011"     => "注册失败,请稍后再试",
    "-1012"     => "您的账号异常或已被禁用,如有疑问请联系官方客服",
    "-1013"     => "亲～请登录！",
    "-1014"     => "退出登录失败",
    "-1015"     => "参数错误",
    "-1016"     => "创建失败",
    "-1017"     => "记录不存在",
    "-1018"     => "商品库存不足",
    "-1019"     => "商品价格和商家发布价格不符",
    "-1020"     => "订单创建失败",
    "-1021"     => "砍价人数已满",
    "-1022"     => "您已经参加过砍价啦",
    "-1023"     => "有人正在砍价，请稍后再试",
    "-1024"     => "成为会员才能领取大礼",
    "-1025"     => "确认收货失败",
    "-1026"     => "请填写大于10个字的内容",
    "-1027"     => "购买vip还未成功",
    "-1028"     => "已经参与过领取礼品",
    "-1029"     => "订单不存在",
    "-1030"     => "该订单投诉正在处理，请勿重复申请",
    "-1031"     => "暂不支持微信支付，请选择支付宝付款",

];